blog/ethics.protoverse.project.org
#+TITLE: A Perspective on Ethics
#+SUBTITLE: Protoverse: Ethical Guidelines
#+DATE: <2023-08-22 Tue>
#+LANGUAGE: en
#+DESCRIPTION: Ethical guidelines for the Protoverse, an approach to engineer an artificial universe that exhibits evolution.
#+KEYWORDS: protoverse, agi rules, ai rules, artificial life ethics, ethics, morals, alife
#+HTML_HEAD_EXTRA: <link rel="canonical" href="https://monkeyjunglejuice.github.io/blog/ethics.protoverse.project.html">
#+SETUPFILE: ../static/setup.org
#+PROPERTY: header-args+ :eval no-export
#+OPTIONS:

#+ATTR_HTML: :class pager
#+begin_nav
This is part of the Protoverse project:
- [[file:introduction.protoverse.project.org][Introduction]]
- [[file:metaphysics.protoverse.project.org][Metaphysics]]
- [[file:engineering.protoverse.project.org][Technical Considerations]]
- [[file:resources.protoverse.project.org][Resources]]
- [[file:model.protoverse.project.org][Computational Model]]
- *[[file:ethics.protoverse.project.org][Ethical Guidelines]]*
#+end_nav

#+begin_message
WORK IN PROGRESS -- Right now, the Protoverse ethics are at a very early stage. There are no actionable guidelines yet, but merely a reflection of personal views that will serve as a starting point.
#+end_message

#+TOC: headlines 2

* What Are We Talking About?

An artificial universe based on open-ended quasi-darwinian evolution comes with the possibility for sentient artificial life and intelligence (at least theoretically). The Protoverse ethics are not about AI safety or regulation, but rather a continuous process that accompanies the ongoing development of the Protoverse.

* How To Develop Ethical Guidelines

It would be a futile endavour trying to work out a static, all-encompassing, detailled ethical ruleset for co-existence with sentient artificial life, without any knowledge /how it will turn out/. My best guess on how it will be: vastly diverse.

I suggest to treat ethical questions not disconnected from reality, but as questions arising naturally from actual phenomena, which need to be adressed in the context of the Protoverse itself. Where conflicts of interest arise, we cannot pre-determine the rules beforehand, but have to mediate based on these (still very vague) obligation.

Sentient artificial life is not disconnected from nature, but the result from the ongoing process of evolution. It will be our offspring, and the responsibilities arise from there.

* Is Creating an Open-ended Artificial Universe Morally Acceptable?

 We'll have to think about what that even means, take care what kind of selective criteria may drive evolution in this context, and what we don't want.

* Safety: What Should Protect Whom from What, Exactly?

** Where Are We Now? An Ethical Inventory

I've been traveling several parts of the world for about 4 years (Central- and South America, Europe and South East Asia). Nevertheless, what I've encountered, re-calibrated my pallette of concerns, so that it expands the bubble of concerns predominantly discussed in the societies of "highly developed" countries.

What shocked me the most is how animals are treated basically everywhere on this planet. The suffering is beyond all imagination:

#+begin_index
- Cats giving birth to kittens every season and their kittens getting killed each time and again;
- Whole litters of kittens and puppies dumped into trash containers, sometimes including their moms, suffocation in plastic bags;
- Street dogs are being captured, taken away by the hundreds, and thrown alive to farmed crocodiles as cheap food (yes, crocodile leather industry);
- Pigs and dogs forced to fight each other to death, the videos uploaded for likes on TikTok /(these videos showed up when my account was fresh; I reported about 50–60 videos — only 3 of these videos have been found to violate their guidelines)/.
#+end_index

I understand the chain of "reasoning" that leads to the fear that a potential superintelligent AI would have more than enough reasons to stuff the human species into zoos or purge them from this planet (at least, when it finds out about that).

