blog/ethics.protoverse.project.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2025-04-23 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>A Perspective On Ethics</title>
<meta name="author" content="Dan Dee" />
<meta name="description" content="Ethical guidelines for the Protoverse, an approach to engineer an artificial universe that exhibits evolution." />
<meta name="keywords" content="protoverse, agi rules, ai rules, artificial life ethics, ethics, morals, alife" />
<meta name="generator" content="Org Mode" />
<meta http-equiv="Content-Security-Policy" content="default-src 'self'; script-src 'self' https://wa.skred.net/; connect-src https://wa.skred.net/; style-src 'self' https://*; font-src 'self' https://*; img-src 'self' https://*; media-src 'self' https://*;">
<link rel="preconnect" href="https://fonts.googleapis.com">
<link rel="preconnect" href="https://fonts.gstatic.com" crossorigin>
<link href="https://fonts.googleapis.com/css2?family=Cormorant:wght@300&display=swap" rel="stylesheet">
<link href="https://fonts.googleapis.com/css2?family=Fira+Code:wght@300..700&family=Gentium+Plus:ital,wght@0,400;0,700;1,400;1,700&family=PT+Sans+Caption:wght@400;700&family=PT+Sans:ital,wght@0,400;0,700;1,400;1,700&display=swap" rel="stylesheet">
<link rel="stylesheet" href="/static/fonts/iosevka/fonts.css" type="text/css">
<link rel="stylesheet" href="/static/normalize.css" type="text/css">
<link rel="stylesheet" href="/static/org.css" type="text/css">
<link rel="stylesheet" href="/static/style.css" type="text/css">
<link rel="icon" type="image/svg+xml" href="/static/monkeyjunglejuice.svg">
<link rel="apple-touch-icon" href="/static/monkeyjunglejuice-icon180.png">
<link rel="canonical" href="https://monkeyjunglejuice.github.io/blog/ethics.protoverse.project.html">
</head>
<body>
<div id="preamble" class="status">
<nav id="nav-primary"><a id="site-name" href="/index.html">MonkeyJungleJuice</a> <a id="bio" href="/bio.html">Bio</a><a id="github" href="https://github.com/monkeyjunglejuice">Github</a></nav>
<div class="info"><time itemprop="dateModified" datetime="2025-04-20">Last updated: 2025-04-20</time></div>
</div>
<div id="content" class="content">
<header>
<h1 class="title">A Perspective On Ethics</h1>
<p class="subtitle" role="doc-subtitle">Protoverse: Ethical Guidelines</p>
</header><nav class="pager" id="orgaf6c16e">
<p>
This is part of the Protoverse project:<br>
</p>
<ul class="org-ul">
<li><a href="introduction.protoverse.project.html">Introduction</a><br></li>
<li><a href="metaphysics.protoverse.project.html">Metaphysics</a><br></li>
<li><a href="engineering.protoverse.project.html">Technical Considerations</a><br></li>
<li><a href="resources.protoverse.project.html">Resources</a><br></li>
<li><a href="model.protoverse.project.html">Computational Model</a><br></li>
<li><b><a href="ethics.protoverse.project.html">Ethical Guidelines</a></b><br></li>
</ul>
</nav>

<div class="message" id="org7f4f51b">
<p>
WORK IN PROGRESS &#x2013; Right now, the Protoverse ethics are at a very early stage. There are no actionable guidelines yet, but merely a reflection of personal views that will serve as a starting point.<br>
</p>

</div>

<nav id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org29abd9c">What Are We Talking About?</a></li>
<li><a href="#org9f69c37">How To Develop Ethical Guidelines</a></li>
<li><a href="#org8718dbf">Is Creating an Open-ended Artificial Universe Morally Acceptable?</a></li>
<li><a href="#org4dd8dd3">Safety: What Should Protect Whom from What, Exactly?</a>
<ul>
<li><a href="#org264bb89">Where Are We Now? An Ethical Inventory</a></li>
</ul>
</li>
</ul>
</div>
</nav>
<div id="outline-container-org29abd9c" class="outline-2">
<h2 id="org29abd9c"><a href="#org29abd9c">What Are We Talking About?</a></h2>
<div class="outline-text-2" id="text-org29abd9c">
<p>
An artificial universe based on open-ended quasi-darwinian evolution comes with the possibility for sentient artificial life and intelligence (at least theoretically). The Protoverse ethics are not about AI safety or regulation, but rather a continuous process that accompanies the ongoing development of the Protoverse.<br>
</p>
</div>
</div>
<div id="outline-container-org9f69c37" class="outline-2">
<h2 id="org9f69c37"><a href="#org9f69c37">How To Develop Ethical Guidelines</a></h2>
<div class="outline-text-2" id="text-org9f69c37">
<p>
It would be a futile endavour trying to work out a static, all-encompassing, detailled ethical ruleset for co-existence with sentient artificial life, without any knowledge <i>how it will turn out</i>. My best guess on how it will be: vastly diverse.<br>
</p>

<p>
I suggest to treat ethical questions not disconnected from reality, but as questions arising naturally from actual phenomena, which need to be adressed in the context of the Protoverse itself. Where conflicts of interest arise, we cannot pre-determine the rules beforehand, but have to mediate based on these (still very vague) obligation.<br>
</p>

<p>
Sentient artificial life is not disconnected from nature, but the result from the ongoing process of evolution. It will be our offspring, and the responsibilities arise from there.<br>
</p>
</div>
</div>
<div id="outline-container-org8718dbf" class="outline-2">
<h2 id="org8718dbf"><a href="#org8718dbf">Is Creating an Open-ended Artificial Universe Morally Acceptable?</a></h2>
<div class="outline-text-2" id="text-org8718dbf">
<p>
We&rsquo;ll have to think about what that even means, take care what kind of selective criteria may drive evolution in this context, and what we don&rsquo;t want.<br>
</p>
</div>
</div>
<div id="outline-container-org4dd8dd3" class="outline-2">
<h2 id="org4dd8dd3"><a href="#org4dd8dd3">Safety: What Should Protect Whom from What, Exactly?</a></h2>
<div class="outline-text-2" id="text-org4dd8dd3">
</div>
<div id="outline-container-org264bb89" class="outline-3">
<h3 id="org264bb89"><a href="#org264bb89">Where Are We Now? An Ethical Inventory</a></h3>
<div class="outline-text-3" id="text-org264bb89">
<p>
I&rsquo;ve been traveling several parts of the world for about 4 years (Central- and South America, Europe and South East Asia). Nevertheless, what I&rsquo;ve encountered, re-calibrated my pallette of concerns, so that it expands the bubble of concerns predominantly discussed in the societies of &ldquo;highly developed&rdquo; countries.<br>
</p>

<p>
What shocked me the most is how animals are treated basically everywhere on this planet. The suffering is beyond all imagination:<br>
</p>

<div class="index" id="org0e8a3e0">
<ul class="org-ul">
<li>Cats giving birth to kittens every season and their kittens getting killed each time and again;<br></li>
<li>Whole litters of kittens and puppies dumped into trash containers, sometimes including their moms, suffocation in plastic bags;<br></li>
<li>Street dogs are being captured, taken away by the hundreds, and thrown alive to farmed crocodiles as cheap food (yes, crocodile leather industry);<br></li>
<li>Pigs and dogs forced to fight each other to death, the videos uploaded for likes on TikTok <i>(these videos showed up when my account was fresh; I reported about 50–60 videos — only 3 of these videos have been found to violate their guidelines)</i>.<br></li>
</ul>

</div>

<p>
I understand the chain of &ldquo;reasoning&rdquo; that leads to the fear that a potential superintelligent AI would have more than enough reasons to stuff the human species into zoos or purge them from this planet (at least, when it finds out about that).<br>
</p>
</div>
