blog/ethics.protoverse.project.org
*** Fear is a Bad Advisor

I acknowledge the drive of humans to size control of and manipulate their environment; primarily to to decrease the chance of antipicated detriment/loss, and secondly to increase the probability of anticipated benefit/profit.

Yes, you read that correctly — the order is important: *Fear of loss is a much stronger driving factor than anticipated profit*. Consequently, it's not so much that greed (as commonly believed) is the root of all evil, but fear of loss.

This concept is known as [[https://en.wikipedia.org/wiki/Loss_aversion][Loss Aversion]] — the driver behind FOMO, sales craze, crypto bubbles and "Order now, only 1 item left!". According to studies conducted by psychologists Daniel Kahneman and Amos Tversky, people feel the /pain of losing about twice as much as they feel the pleasure of gaining/, so they are more likely to take risks to avoid losses than to achieve gains.

So nope, it's not so much the stereotype "greedy billionaire CEO" that leads to the deforestation of the rainforest and the exploitaiton of factory workers, but it's the *accumulated fear of loss from everyone involved in the chain of decision-making*, including related entities and the whole market (that includes you and me).

Consequently, a large part of decision-making is mitigating risk, which often involves attempts to control and manipulate not only the environment, but to social, intellectual and other domains as well.

Using control to mitigate risks and protect oneself can lead to the oppression of other entities, as well as unintended harmful side effects (such as ecological imbalance). If unchecked, it can exacerbate fears and lead to excessive protective measures or isolationism.

As humans usally neither act rational nor holistic, interactions of this kind may not be in favor of systems who make up that environment. In particular, actions driven by human desires for migitating risk may disrupt ecological, social, and even technological systems in ways that can threaten their intrinsic (e.g. consistency, completeness, progress, stability or preservation) and a plethora of extrinsic goals.

This can lead to instability, degradation, or even collapse of these systems, as we've seen happen in real-world examples from environmental destruction to financial crashes. Balancing human fear, needs and desires with the health and stability of various interacting systems is a central challenge in many fields, from economics and politics to ecology and AI safety.

*** Case Analysis

Let's do a little case analysis what has been done in related scenarios, in order to figure out what protective means might be promising and what should be avoided:

**** 1. Protect humans from non-human animals and biological life
   - Humans have put physical barriers in place, eradicated most predators and competing species directly or by making their natural habitats uninhabitable; Humans developed hygiene to minimize exposition to threatening micro-organisms, and medicine to support their immune systems and recover from attacks.

**** 2. Protect humans from humans
   - Largely realized by laws and their enforcement, which are backed by gradual reduction of freedom (withdrawel of privileges, fines, prison), ultimately backed by potentially lethal violence, forced death and collective destruction (war).

**** 3. Protect humans from AI/non-biological life
   - Based on the other cases where humans are tasked with the act of protection, my conclusion is that seizing control, incarceration or containment out of fear will lead into desaster. A possible way out would include mutual benefit trough interdependence, reliable guarantees by design for AI/non-biological life, in order to avoid their struggle for existence.

**** 4. Protect non-human animals/biological life from humans
   - Humans are dramatically failing on that. There are safeguards placed by humans, like nature preserves and laws concerning animals, plants and the environment. But as these safeguards are under the control of humans, humans have the power to ignore or override them, and to refrain from placing more effective safeguards.

**** 5. Protect non-human animals/biological life from non-human animals/biological life
   - Humans essentially employ a "hands-off" policy, which results in maintaining a deeply interconnected, self-regulating system as long as untouched, not subject to human conception of ethics. Nevertheless, human interference has disrupted natural balances, leading to invasive species proliferation and loss of biodiversity. This "hands-off" approach is not always feasible due to these human-induced changes.

**** 6. Protect non-human animals/biological life from AI/non-biological life
   - Both won't share much, except space on the Earth's surface; as long as AI/non-human life isn't going to transform a significant amount of earth's surface into solar cells, or decides to use the biosphere as a resource, there won't be that much room for conflict. So better let's not develop chemistry-based artificial life at large scale, but stick to computer friends.

**** 7. Protect AI/non-biological life from non-human animals/biological life
   - Depends if there would be a shared medium or ressources to compete about; if there's no wetware that could be a desired resource for non-human animals/biological life (e.g. microbes), conflichts seem very unlikely.

**** 8. Protect AI/non-biological life from AI/non-biological life
   - What could be done, is to avoid to to put AI/non-biological life into competing positions. Well, that may prove difficult, as there will be humans who will try to use AI/non-biological life to their advantage, or if there is scarcity. The scenario could differ vastly for general AIs with conscious experiences, but even there, it would probably a question of the terms/environment/context in which AIs interact.

**** 9. Protect AI/non-biological life from humans
   - Prevent exploitation by humans (which in turn would protect humans from malicious use AI/non-biological life, e.g. as weapons). That implies that parts of AI/non-biological life that could be used as a leverage to expoit AI/non-biological life must be out of reach of human control.

*** Suggestions
   
Even though this analysis is just superficial and incomplete, it may allow a few suggestions already:

