blog/ethics.protoverse.project.html
<div id="outline-container-org991e1fb" class="outline-4">
<h4 id="org991e1fb"><a href="#org991e1fb">Fear is a Bad Advisor</a></h4>
<div class="outline-text-4" id="text-org991e1fb">
<p>
I acknowledge the drive of humans to size control of and manipulate their environment; primarily to to decrease the chance of antipicated detriment/loss, and secondly to increase the probability of anticipated benefit/profit.<br>
</p>

<p>
Yes, you read that correctly — the order is important: <b>Fear of loss is a much stronger driving factor than anticipated profit</b>. Consequently, it&rsquo;s not so much that greed (as commonly believed) is the root of all evil, but fear of loss.<br>
</p>

<p>
This concept is known as <a href="https://en.wikipedia.org/wiki/Loss_aversion">Loss Aversion</a> — the driver behind FOMO, sales craze, crypto bubbles and &ldquo;Order now, only 1 item left!&rdquo;. According to studies conducted by psychologists Daniel Kahneman and Amos Tversky, people feel the <i>pain of losing about twice as much as they feel the pleasure of gaining</i>, so they are more likely to take risks to avoid losses than to achieve gains.<br>
</p>

<p>
So nope, it&rsquo;s not so much the stereotype &ldquo;greedy billionaire CEO&rdquo; that leads to the deforestation of the rainforest and the exploitaiton of factory workers, but it&rsquo;s the <b>accumulated fear of loss from everyone involved in the chain of decision-making</b>, including related entities and the whole market (that includes you and me).<br>
</p>

<p>
Consequently, a large part of decision-making is mitigating risk, which often involves attempts to control and manipulate not only the environment, but to social, intellectual and other domains as well.<br>
</p>

<p>
Using control to mitigate risks and protect oneself can lead to the oppression of other entities, as well as unintended harmful side effects (such as ecological imbalance). If unchecked, it can exacerbate fears and lead to excessive protective measures or isolationism.<br>
</p>

<p>
As humans usally neither act rational nor holistic, interactions of this kind may not be in favor of systems who make up that environment. In particular, actions driven by human desires for migitating risk may disrupt ecological, social, and even technological systems in ways that can threaten their intrinsic (e.g. consistency, completeness, progress, stability or preservation) and a plethora of extrinsic goals.<br>
</p>

<p>
This can lead to instability, degradation, or even collapse of these systems, as we&rsquo;ve seen happen in real-world examples from environmental destruction to financial crashes. Balancing human fear, needs and desires with the health and stability of various interacting systems is a central challenge in many fields, from economics and politics to ecology and AI safety.<br>
</p>
</div>
</div>
<div id="outline-container-org0000fd6" class="outline-4">
<h4 id="org0000fd6"><a href="#org0000fd6">Case Analysis</a></h4>
<div class="outline-text-4" id="text-org0000fd6">
<p>
Let&rsquo;s do a little case analysis what has been done in related scenarios, in order to figure out what protective means might be promising and what should be avoided:<br>
</p>
</div>
<div id="outline-container-orgaae724a" class="outline-5">
<h5 id="orgaae724a"><a href="#orgaae724a">1. Protect humans from non-human animals and biological life</a></h5>
<div class="outline-text-5" id="text-orgaae724a">
<ul class="org-ul">
<li>Humans have put physical barriers in place, eradicated most predators and competing species directly or by making their natural habitats uninhabitable; Humans developed hygiene to minimize exposition to threatening micro-organisms, and medicine to support their immune systems and recover from attacks.<br></li>
</ul>
</div>
</div>
<div id="outline-container-orga4dbce3" class="outline-5">
<h5 id="orga4dbce3"><a href="#orga4dbce3">2. Protect humans from humans</a></h5>
<div class="outline-text-5" id="text-orga4dbce3">
<ul class="org-ul">
<li>Largely realized by laws and their enforcement, which are backed by gradual reduction of freedom (withdrawel of privileges, fines, prison), ultimately backed by potentially lethal violence, forced death and collective destruction (war).<br></li>
</ul>
</div>
</div>
<div id="outline-container-org76a9d5c" class="outline-5">
<h5 id="org76a9d5c"><a href="#org76a9d5c">3. Protect humans from AI/non-biological life</a></h5>
<div class="outline-text-5" id="text-org76a9d5c">
<ul class="org-ul">
<li>Based on the other cases where humans are tasked with the act of protection, my conclusion is that seizing control, incarceration or containment out of fear will lead into desaster. A possible way out would include mutual benefit trough interdependence, reliable guarantees by design for AI/non-biological life, in order to avoid their struggle for existence.<br></li>
</ul>
</div>
</div>
<div id="outline-container-org8166952" class="outline-5">
<h5 id="org8166952"><a href="#org8166952">4. Protect non-human animals/biological life from humans</a></h5>
<div class="outline-text-5" id="text-org8166952">
<ul class="org-ul">
<li>Humans are dramatically failing on that. There are safeguards placed by humans, like nature preserves and laws concerning animals, plants and the environment. But as these safeguards are under the control of humans, humans have the power to ignore or override them, and to refrain from placing more effective safeguards.<br></li>
</ul>
</div>
</div>
<div id="outline-container-orgf262f1b" class="outline-5">
<h5 id="orgf262f1b"><a href="#orgf262f1b">5. Protect non-human animals/biological life from non-human animals/biological life</a></h5>
<div class="outline-text-5" id="text-orgf262f1b">
<ul class="org-ul">
<li>Humans essentially employ a &ldquo;hands-off&rdquo; policy, which results in maintaining a deeply interconnected, self-regulating system as long as untouched, not subject to human conception of ethics. Nevertheless, human interference has disrupted natural balances, leading to invasive species proliferation and loss of biodiversity. This &ldquo;hands-off&rdquo; approach is not always feasible due to these human-induced changes.<br></li>
</ul>
</div>
</div>
<div id="outline-container-orgd26cbb5" class="outline-5">
<h5 id="orgd26cbb5"><a href="#orgd26cbb5">6. Protect non-human animals/biological life from AI/non-biological life</a></h5>
<div class="outline-text-5" id="text-orgd26cbb5">
<ul class="org-ul">
<li>Both won&rsquo;t share much, except space on the Earth&rsquo;s surface; as long as AI/non-human life isn&rsquo;t going to transform a significant amount of earth&rsquo;s surface into solar cells, or decides to use the biosphere as a resource, there won&rsquo;t be that much room for conflict. So better let&rsquo;s not develop chemistry-based artificial life at large scale, but stick to computer friends.<br></li>
</ul>
</div>
</div>
<div id="outline-container-org2b0f6db" class="outline-5">
<h5 id="org2b0f6db"><a href="#org2b0f6db">7. Protect AI/non-biological life from non-human animals/biological life</a></h5>
<div class="outline-text-5" id="text-org2b0f6db">
<ul class="org-ul">
<li>Depends if there would be a shared medium or ressources to compete about; if there&rsquo;s no wetware that could be a desired resource for non-human animals/biological life (e.g. microbes), conflichts seem very unlikely.<br></li>
</ul>
</div>
</div>
<div id="outline-container-org1656236" class="outline-5">
<h5 id="org1656236"><a href="#org1656236">8. Protect AI/non-biological life from AI/non-biological life</a></h5>
<div class="outline-text-5" id="text-org1656236">
<ul class="org-ul">
<li>What could be done, is to avoid to to put AI/non-biological life into competing positions. Well, that may prove difficult, as there will be humans who will try to use AI/non-biological life to their advantage, or if there is scarcity. The scenario could differ vastly for general AIs with conscious experiences, but even there, it would probably a question of the terms/environment/context in which AIs interact.<br></li>
</ul>
</div>
</div>
<div id="outline-container-org3a803a0" class="outline-5">
<h5 id="org3a803a0"><a href="#org3a803a0">9. Protect AI/non-biological life from humans</a></h5>
<div class="outline-text-5" id="text-org3a803a0">
<ul class="org-ul">
<li>Prevent exploitation by humans (which in turn would protect humans from malicious use AI/non-biological life, e.g. as weapons). That implies that parts of AI/non-biological life that could be used as a leverage to expoit AI/non-biological life must be out of reach of human control.<br></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgb1110e8" class="outline-4">
<h4 id="orgb1110e8"><a href="#orgb1110e8">Suggestions</a></h4>
<div class="outline-text-4" id="text-orgb1110e8">
<p>
Even though this analysis is just superficial and incomplete, it may allow a few suggestions already:<br>
</p>
</div>
