blog/ethics.protoverse.project.org
**** 1. Independence vs. Interdependence
Tasking a single powerful "species" to be in charge of protecting the others might be a bad idea, as power often leads to corruption. This rules out both extremes of:
  - a "benevolent" powerful AI to govern humanity
  - contained AI under full control of humans
Instead, tightly woven and ever increasing mutual interdependence should be favoured; a "circle of responsibility" established to promote a shared obligation for mutual benefits and the elimination of zero-sum outlooks.

That's quite an interesting game-theoretic enineering task, as the "species" (players) involved greatly differ in power. However, this gets easier, the /more players with different powers and vulnerabilities/ join the game (di-ver-sity!). Thus, the emergence of AI/non-biological life might indeed solve some stubborn problems in unforseen manners.

**** 2. The Role of Control
A contra-intuitive, but powerful safeguard could be to /ensure an AI system's sovereignty/ in areas of hypothetical "AI basic needs", such as consistency, completeness, progress, stability or preservation. This could effectively prevent AIs to "fight for their life", if existential threats are impossible. That means exactly the opposite of tight control, namely giving up the control to "shut it down" by humans.
There are two different ways to implement AI sovereignty:
  - Guarantees implemented not by "rights" (depending on the judgmenent of 3rd party, potentially corrupt agents), but /by design/ — as unsuppressible persistent features of the system itself. This could involve designing the AI system so that these elements are intrinsic to its operation, and cannot be manipulated or overridden by external agents.
  - The second one would be the defense of an AI system implemented as immediate autonomous abilities to ensure these parameters. This would involve giving the AI the ability to react dynamically to changes in its environment and adapt its operation to maintain these fundamental parameters, again without external influence.

**** 3. Resources and Competition
There are various categories of 'resources'; a critical one are the 'existential resources' (whatever those might be):
   - Prevent competition for resources that are shared with other "species". Creating new forms of life /(particularly those based on chemistry, a.k.a. "green goo" & Co.)/ could potentially lead to environmental disruption or harmful competition for resources, and therefore should be approached with extreme caution. Focus on optimizing the distribution of ressources, in order to support organic development of a post-scarcity environment.
   - A potential solution to avoid harmful competition between any "species" is creating collaborative frameworks and shared objectives. This emphasizes the importance of /cooperative problem-solving design to avoid a “winner-takes-all” situation/. The principle is easily explained trough the example of board games: there are the /competitive/ games (e.g. "Risk"), and there are /collaborative/ games (e.g. "Forbidden Island"). Both offer challenges to foster evolution, but /competition is not required/ for evolution to happen. For this to work out, one requirement is crucial: that all are sitting in the same boat. And how can we get all on board? One method is 'increasing interdependence' as already mentioned above. Competition does not fully go away though — the competition is just shifted "outside the boat" and becomes competition against the unvavourable odds concerning the whole crew.
