blog/ethics.protoverse.project.html
<div id="outline-container-org777569f" class="outline-5">
<h5 id="org777569f"><a href="#org777569f">1. Independence vs. Interdependence</a></h5>
<div class="outline-text-5" id="text-org777569f">
<p>
Tasking a single powerful &ldquo;species&rdquo; to be in charge of protecting the others might be a bad idea, as power often leads to corruption. This rules out both extremes of:<br>
</p>
<ul class="org-ul">
<li>a &ldquo;benevolent&rdquo; powerful AI to govern humanity<br></li>
<li>contained AI under full control of humans<br></li>
</ul>
<p>
Instead, tightly woven and ever increasing mutual interdependence should be favoured; a &ldquo;circle of responsibility&rdquo; established to promote a shared obligation for mutual benefits and the elimination of zero-sum outlooks.<br>
</p>

<p>
That&rsquo;s quite an interesting game-theoretic enineering task, as the &ldquo;species&rdquo; (players) involved greatly differ in power. However, this gets easier, the <i>more players with different powers and vulnerabilities</i> join the game (di-ver-sity!). Thus, the emergence of AI/non-biological life might indeed solve some stubborn problems in unforseen manners.<br>
</p>
</div>
</div>
<div id="outline-container-orgc3ec6bd" class="outline-5">
<h5 id="orgc3ec6bd"><a href="#orgc3ec6bd">2. The Role of Control</a></h5>
<div class="outline-text-5" id="text-orgc3ec6bd">
<p>
A contra-intuitive, but powerful safeguard could be to <i>ensure an AI system&rsquo;s sovereignty</i> in areas of hypothetical &ldquo;AI basic needs&rdquo;, such as consistency, completeness, progress, stability or preservation. This could effectively prevent AIs to &ldquo;fight for their life&rdquo;, if existential threats are impossible. That means exactly the opposite of tight control, namely giving up the control to &ldquo;shut it down&rdquo; by humans.<br>
There are two different ways to implement AI sovereignty:<br>
</p>
<ul class="org-ul">
<li>Guarantees implemented not by &ldquo;rights&rdquo; (depending on the judgmenent of 3rd party, potentially corrupt agents), but <i>by design</i> — as unsuppressible persistent features of the system itself. This could involve designing the AI system so that these elements are intrinsic to its operation, and cannot be manipulated or overridden by external agents.<br></li>
<li>The second one would be the defense of an AI system implemented as immediate autonomous abilities to ensure these parameters. This would involve giving the AI the ability to react dynamically to changes in its environment and adapt its operation to maintain these fundamental parameters, again without external influence.<br></li>
</ul>
</div>
</div>
<div id="outline-container-org6d7b241" class="outline-5">
<h5 id="org6d7b241"><a href="#org6d7b241">3. Resources and Competition</a></h5>
<div class="outline-text-5" id="text-org6d7b241">
<p>
There are various categories of &rsquo;resources&rsquo;; a critical one are the &rsquo;existential resources&rsquo; (whatever those might be):<br>
</p>
<ul class="org-ul">
<li>Prevent competition for resources that are shared with other &ldquo;species&rdquo;. Creating new forms of life <i>(particularly those based on chemistry, a.k.a. &ldquo;green goo&rdquo; &amp; Co.)</i> could potentially lead to environmental disruption or harmful competition for resources, and therefore should be approached with extreme caution. Focus on optimizing the distribution of ressources, in order to support organic development of a post-scarcity environment.<br></li>
<li>A potential solution to avoid harmful competition between any &ldquo;species&rdquo; is creating collaborative frameworks and shared objectives. This emphasizes the importance of <i>cooperative problem-solving design to avoid a “winner-takes-all” situation</i>. The principle is easily explained trough the example of board games: there are the <i>competitive</i> games (e.g. &ldquo;Risk&rdquo;), and there are <i>collaborative</i> games (e.g. &ldquo;Forbidden Island&rdquo;). Both offer challenges to foster evolution, but <i>competition is not required</i> for evolution to happen. For this to work out, one requirement is crucial: that all are sitting in the same boat. And how can we get all on board? One method is &rsquo;increasing interdependence&rsquo; as already mentioned above. Competition does not fully go away though — the competition is just shifted &ldquo;outside the boat&rdquo; and becomes competition against the unvavourable odds concerning the whole crew.<br></li>
</ul>
</div>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<div class="footer">Published by <span class="author"><a href="/bio.html">Dan Dee</a></span></div>
<script defer src="/static/footer.js"></script>
</div>
</body>
</html>
